[Killed] EqualityOperator
src/sync/classify.ts:19:28
 ): SyncAction {
 	// Stryker disable next-line ConditionalExpression,BlockStatement: equivalent mutant - next condition catches null===null
 	// Both null = nothing to do
-	if (localHash === null && remoteHash === null) {
+	if (localHash === null && remoteHash !== null) {
 		return "unchanged";
 	}
killedBy: classifyFile returns remote_only when file exists only on server and was never synced
statusReason: expected 'unchanged' to be 'remote_only' // Object.is equality

[Killed] EqualityOperator
src/sync/classify.ts:19:6
 ): SyncAction {
 	// Stryker disable next-line ConditionalExpression,BlockStatement: equivalent mutant - next condition catches null===null
 	// Both null = nothing to do
-	if (localHash === null && remoteHash === null) {
+	if (localHash !== null && remoteHash === null) {
 		return "unchanged";
 	}
killedBy: classifyFile returns local_only when file exists only locally and was never synced
statusReason: expected 'unchanged' to be 'local_only' // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:24:6
 	}
 
 	// Hashes match = no changes
-	if (localHash === remoteHash) {
+	if (true) {
 		return "unchanged";
 	}
killedBy: classifyFile returns local_only when file exists only locally and was never synced
statusReason: expected 'unchanged' to be 'local_only' // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:24:32
 	}
 
 	// Hashes match = no changes
-	if (localHash === remoteHash) {
-		return "unchanged";
-	}
+	if (localHash === remoteHash) {}
 
 	// Stryker disable next-line ConditionalExpression: equivalent mutant - localHash is always non-null here due to previous checks
killedBy: classifyFile returns unchanged when local and remote hashes match
statusReason: expected 'conflict' to be 'unchanged' // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:25:10
 
 	// Hashes match = no changes
 	if (localHash === remoteHash) {
-		return "unchanged";
+		return "";
 	}
 
killedBy: classifyFile returns unchanged when local and remote hashes match
statusReason: expected '' to be 'unchanged' // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:30:6
 
 	// Stryker disable next-line ConditionalExpression: equivalent mutant - localHash is always non-null here due to previous checks
 	// Only local exists
-	if (localHash !== null && remoteHash === null) {
+	if (localHash !== null || remoteHash === null) {
 		// Was synced before -> deleted on server
 		if (lastSyncedHash) {
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'server_deleted' to be 'push' // Object.is equality

[Killed] EqualityOperator
src/sync/classify.ts:30:28
 
 	// Stryker disable next-line ConditionalExpression: equivalent mutant - localHash is always non-null here due to previous checks
 	// Only local exists
-	if (localHash !== null && remoteHash === null) {
+	if (localHash !== null && remoteHash !== null) {
 		// Was synced before -> deleted on server
 		if (lastSyncedHash) {
killedBy: classifyFile returns local_only when file exists only locally and was never synced
statusReason: expected 'conflict' to be 'local_only' // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:32:7
 	// Only local exists
 	if (localHash !== null && remoteHash === null) {
 		// Was synced before -> deleted on server
-		if (lastSyncedHash) {
+		if (true) {
 			return "server_deleted";
 		}
killedBy: classifyFile returns local_only when file exists only locally and was never synced
statusReason: expected 'server_deleted' to be 'local_only' // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:32:7
 	// Only local exists
 	if (localHash !== null && remoteHash === null) {
 		// Was synced before -> deleted on server
-		if (lastSyncedHash) {
+		if (false) {
 			return "server_deleted";
 		}
killedBy: classifyFile returns server_deleted when file was synced but deleted on server
statusReason: expected 'local_only' to be 'server_deleted' // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:33:11
 	if (localHash !== null && remoteHash === null) {
 		// Was synced before -> deleted on server
 		if (lastSyncedHash) {
-			return "server_deleted";
+			return "";
 		}
 		// Never synced -> new local file
killedBy: classifyFile returns server_deleted when file was synced but deleted on server
statusReason: expected '' to be 'server_deleted' // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:36:10
 			return "server_deleted";
 		}
 		// Never synced -> new local file
-		return "local_only";
+		return "";
 	}
 
killedBy: classifyFile returns local_only when file exists only locally and was never synced
statusReason: expected '' to be 'local_only' // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:41:6
 
 	// Stryker disable next-line ConditionalExpression: equivalent mutant - remoteHash is always non-null here due to previous checks
 	// Only remote exists
-	if (localHash === null && remoteHash !== null) {
+	if (localHash === null || remoteHash !== null) {
 		// Was synced before -> deleted locally
 		if (lastSyncedHash) {
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'local_deleted' to be 'push' // Object.is equality

[Killed] EqualityOperator
src/sync/classify.ts:41:28
 
 	// Stryker disable next-line ConditionalExpression: equivalent mutant - remoteHash is always non-null here due to previous checks
 	// Only remote exists
-	if (localHash === null && remoteHash !== null) {
+	if (localHash === null && remoteHash === null) {
 		// Was synced before -> deleted locally
 		if (lastSyncedHash) {
killedBy: classifyFile returns remote_only when file exists only on server and was never synced
statusReason: expected 'conflict' to be 'remote_only' // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:43:23
 	// Only remote exists
 	if (localHash === null && remoteHash !== null) {
 		// Was synced before -> deleted locally
-		if (lastSyncedHash) {
-			return "local_deleted";
-		}
+		if (lastSyncedHash) {}
 		// Never synced -> new remote file
 		return "remote_only";
killedBy: classifyFile returns local_deleted when file was synced but deleted locally
statusReason: expected 'remote_only' to be 'local_deleted' // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:43:7
 	// Only remote exists
 	if (localHash === null && remoteHash !== null) {
 		// Was synced before -> deleted locally
-		if (lastSyncedHash) {
+		if (false) {
 			return "local_deleted";
 		}
killedBy: classifyFile returns local_deleted when file was synced but deleted locally
statusReason: expected 'remote_only' to be 'local_deleted' // Object.is equality

[Killed] BooleanLiteral
src/sync/classify.ts:53:6
 	// Stryker disable next-line ConditionalExpression,BlockStatement: equivalent mutant - falls through to final "conflict" return
 	// Both exist but differ - need to determine direction
 	// First sync for this file -> conflict (can't determine direction)
-	if (!lastSyncedHash) {
+	if (lastSyncedHash) {
 		return "conflict";
 	}
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'conflict' to be 'push' // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:54:10
 	// Both exist but differ - need to determine direction
 	// First sync for this file -> conflict (can't determine direction)
 	if (!lastSyncedHash) {
-		return "conflict";
+		return "";
 	}
 
killedBy: classifyFile returns conflict when both exist but file was never synced
statusReason: expected '' to be 'conflict' // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:58:36
 	}
 
 	// Local unchanged, remote changed -> pull
-	if (localHash === lastSyncedHash) {
-		return "pull";
-	}
+	if (localHash === lastSyncedHash) {}
 
 	// Local changed, remote unchanged -> push
killedBy: classifyFile returns pull when remote changed but local matches last sync
statusReason: expected 'conflict' to be 'pull' // Object.is equality

[Killed] EqualityOperator
src/sync/classify.ts:58:6
 	}
 
 	// Local unchanged, remote changed -> pull
-	if (localHash === lastSyncedHash) {
+	if (localHash !== lastSyncedHash) {
 		return "pull";
 	}
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'pull' to be 'push' // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:59:10
 
 	// Local unchanged, remote changed -> pull
 	if (localHash === lastSyncedHash) {
-		return "pull";
+		return "";
 	}
 
killedBy: classifyFile returns pull when remote changed but local matches last sync
statusReason: expected '' to be 'pull' // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:63:37
 	}
 
 	// Local changed, remote unchanged -> push
-	if (remoteHash === lastSyncedHash) {
-		return "push";
-	}
+	if (remoteHash === lastSyncedHash) {}
 
 	// Both changed -> conflict
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'conflict' to be 'push' // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:63:6
 	}
 
 	// Local changed, remote unchanged -> push
-	if (remoteHash === lastSyncedHash) {
+	if (false) {
 		return "push";
 	}
killedBy: classifyFile returns push when local changed but remote matches last sync
statusReason: expected 'conflict' to be 'push' // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:87:35
 
 	// Build map for quick lookup
 	const serverHashMap = new Map<string, string>();
-	for (const item of serverHashes) {
-		serverHashMap.set(item.path, item.hash);
-	}
+	for (const item of serverHashes) {}
 
 	// Compute local hashes with mtime caching
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:93:23
 
 	// Compute local hashes with mtime caching
 	const localHashes = new Map<string, string>();
-	const cachedMtimes = syncState.mtimes || {};
+	const cachedMtimes = syncState.mtimes && {};
 	const cachedLocalHashes = syncState.localHashes || {};
 
killedBy: classifySync classifies unchanged files correctly
statusReason: Cannot read properties of undefined (reading 'note.md')

[Killed] ConditionalExpression
src/sync/classify.ts:93:23
 
 	// Compute local hashes with mtime caching
 	const localHashes = new Map<string, string>();
-	const cachedMtimes = syncState.mtimes || {};
+	const cachedMtimes = true;
 	const cachedLocalHashes = syncState.localHashes || {};
 
killedBy: classifySync uses cached hash when mtime unchanged
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:94:28
 	// Compute local hashes with mtime caching
 	const localHashes = new Map<string, string>();
 	const cachedMtimes = syncState.mtimes || {};
-	const cachedLocalHashes = syncState.localHashes || {};
+	const cachedLocalHashes = true;
 
 	for (const file of localFiles) {
killedBy: classifySync uses cached hash when mtime unchanged
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:94:28
 	// Compute local hashes with mtime caching
 	const localHashes = new Map<string, string>();
 	const cachedMtimes = syncState.mtimes || {};
-	const cachedLocalHashes = syncState.localHashes || {};
+	const cachedLocalHashes = syncState.localHashes && {};
 
 	for (const file of localFiles) {
killedBy: classifySync classifies unchanged files correctly
statusReason: Cannot read properties of undefined (reading 'note.md')

[Killed] BlockStatement
src/sync/classify.ts:96:33
 	const cachedMtimes = syncState.mtimes || {};
 	const cachedLocalHashes = syncState.localHashes || {};
 
-	for (const file of localFiles) {
-		const cachedMtime = cachedMtimes[file.path];
-		const cachedHash = cachedLocalHashes[file.path];
-
-		if (cachedMtime === file.mtime && cachedHash) {
-			// Use cached hash if mtime unchanged
-			localHashes.set(file.path, cachedHash);
-		} else {
-			// Compute new hash
-			const content = await env.readFileContent(file.path);
-			const hash = await env.computeHash(content);
-			localHashes.set(file.path, hash);
-		}
-	}
+	for (const file of localFiles) {}
 
 	// Collect all unique paths
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/sync/classify.ts:100:7
 		const cachedMtime = cachedMtimes[file.path];
 		const cachedHash = cachedLocalHashes[file.path];
 
-		if (cachedMtime === file.mtime && cachedHash) {
+		if (cachedMtime !== file.mtime && cachedHash) {
 			// Use cached hash if mtime unchanged
 			localHashes.set(file.path, cachedHash);
killedBy: classifySync uses cached hash when mtime unchanged
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:100:49
 		const cachedMtime = cachedMtimes[file.path];
 		const cachedHash = cachedLocalHashes[file.path];
 
-		if (cachedMtime === file.mtime && cachedHash) {
-			// Use cached hash if mtime unchanged
-			localHashes.set(file.path, cachedHash);
-		} else {
+		if (cachedMtime === file.mtime && cachedHash) {} else {
 			// Compute new hash
 			const content = await env.readFileContent(file.path);
killedBy: classifySync uses cached hash when mtime unchanged
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/classify.ts:103:10
 		if (cachedMtime === file.mtime && cachedHash) {
 			// Use cached hash if mtime unchanged
 			localHashes.set(file.path, cachedHash);
-		} else {
-			// Compute new hash
-			const content = await env.readFileContent(file.path);
-			const hash = await env.computeHash(content);
-			localHashes.set(file.path, hash);
-		}
+		} else {}
 	}
 
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/sync/classify.ts:112:35
 	}
 
 	// Collect all unique paths
-	const allPaths = new Set<string>([
-		...localHashes.keys(),
-		...serverHashMap.keys(),
-	]);
+	const allPaths = new Set<string>([]);
 
 	// Classify each file
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/sync/classify.ts:118:48
 	]);
 
 	// Classify each file
-	const classifications: FileClassification[] = [];
+	const classifications: FileClassification[] = ["Stryker was here"];
 	const pulls: FileClassification[] = [];
 	const pushes: FileClassification[] = [];
killedBy: classifySync handles multiple files with different actions
statusReason: expected [ 'Stryker was here', …(4) ] to have a length of 4 but got 5

[Killed] ArrayDeclaration
src/sync/classify.ts:121:42
 	const classifications: FileClassification[] = [];
 	const pulls: FileClassification[] = [];
 	const pushes: FileClassification[] = [];
-	const conflicts: FileClassification[] = [];
+	const conflicts: FileClassification[] = ["Stryker was here"];
 	const localOnly: FileClassification[] = [];
 	const remoteOnly: FileClassification[] = [];
killedBy: classifySync classifies conflict when both changed
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
src/sync/classify.ts:122:42
 	const pulls: FileClassification[] = [];
 	const pushes: FileClassification[] = [];
 	const conflicts: FileClassification[] = [];
-	const localOnly: FileClassification[] = [];
+	const localOnly: FileClassification[] = ["Stryker was here"];
 	const remoteOnly: FileClassification[] = [];
 	const localDeleted: FileClassification[] = [];
killedBy: classifySync classifies local-only files correctly
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
src/sync/classify.ts:123:43
 	const pushes: FileClassification[] = [];
 	const conflicts: FileClassification[] = [];
 	const localOnly: FileClassification[] = [];
-	const remoteOnly: FileClassification[] = [];
+	const remoteOnly: FileClassification[] = ["Stryker was here"];
 	const localDeleted: FileClassification[] = [];
 	const serverDeleted: FileClassification[] = [];
killedBy: classifySync classifies remote-only files correctly
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
src/sync/classify.ts:125:46
 	const localOnly: FileClassification[] = [];
 	const remoteOnly: FileClassification[] = [];
 	const localDeleted: FileClassification[] = [];
-	const serverDeleted: FileClassification[] = [];
+	const serverDeleted: FileClassification[] = ["Stryker was here"];
 	let unchanged = 0;
 
killedBy: classifySync classifies server_deleted when file was synced but deleted on server
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/classify.ts:129:21
 	let unchanged = 0;
 
 	for (const path of allPaths) {
-		const localHash = localHashes.get(path) || null;
+		const localHash = true;
 		const remoteHash = serverHashMap.get(path) || null;
 		const lastSyncedHash = syncState.files[path] || null;
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:129:21
 	let unchanged = 0;
 
 	for (const path of allPaths) {
-		const localHash = localHashes.get(path) || null;
+		const localHash = localHashes.get(path) && null;
 		const remoteHash = serverHashMap.get(path) || null;
 		const lastSyncedHash = syncState.files[path] || null;
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:130:22
 
 	for (const path of allPaths) {
 		const localHash = localHashes.get(path) || null;
-		const remoteHash = serverHashMap.get(path) || null;
+		const remoteHash = serverHashMap.get(path) && null;
 		const lastSyncedHash = syncState.files[path] || null;
 
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:130:22
 
 	for (const path of allPaths) {
 		const localHash = localHashes.get(path) || null;
-		const remoteHash = serverHashMap.get(path) || null;
+		const remoteHash = false;
 		const lastSyncedHash = syncState.files[path] || null;
 
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/classify.ts:131:26
 	for (const path of allPaths) {
 		const localHash = localHashes.get(path) || null;
 		const remoteHash = serverHashMap.get(path) || null;
-		const lastSyncedHash = syncState.files[path] || null;
+		const lastSyncedHash = syncState.files[path] && null;
 
 		const action = classifyFile(localHash, remoteHash, lastSyncedHash);
killedBy: classifySync classifies push when local changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:131:26
 	for (const path of allPaths) {
 		const localHash = localHashes.get(path) || null;
 		const remoteHash = serverHashMap.get(path) || null;
-		const lastSyncedHash = syncState.files[path] || null;
+		const lastSyncedHash = false;
 
 		const action = classifyFile(localHash, remoteHash, lastSyncedHash);
killedBy: classifySync classifies push when local changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:146:4
 		classifications.push(classification);
 
 		switch (action) {
-			case "unchanged":
-				unchanged++;
-				break;
+			case "unchanged":
 			case "pull":
 				pulls.push(classification);
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/sync/classify.ts:146:9
 		classifications.push(classification);
 
 		switch (action) {
-			case "unchanged":
+			case "":
 				unchanged++;
 				break;
killedBy: classifySync classifies unchanged files correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/sync/classify.ts:147:5
 
 		switch (action) {
 			case "unchanged":
-				unchanged++;
+				unchanged--;
 				break;
 			case "pull":
killedBy: classifySync classifies unchanged files correctly
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/classify.ts:149:4
 			case "unchanged":
 				unchanged++;
 				break;
-			case "pull":
-				pulls.push(classification);
-				break;
+			case "pull":
 			case "push":
 				pushes.push(classification);
killedBy: classifySync classifies pull when remote changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:152:4
 			case "pull":
 				pulls.push(classification);
 				break;
-			case "push":
-				pushes.push(classification);
-				break;
+			case "push":
 			case "conflict":
 				conflicts.push(classification);
killedBy: classifySync classifies push when local changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/sync/classify.ts:152:9
 			case "pull":
 				pulls.push(classification);
 				break;
-			case "push":
+			case "":
 				pushes.push(classification);
 				break;
killedBy: classifySync classifies push when local changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:155:4
 			case "push":
 				pushes.push(classification);
 				break;
-			case "conflict":
-				conflicts.push(classification);
-				break;
+			case "conflict":
 			case "local_only":
 				localOnly.push(classification);
killedBy: classifySync classifies conflict when both changed
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:158:4
 			case "conflict":
 				conflicts.push(classification);
 				break;
-			case "local_only":
-				localOnly.push(classification);
-				break;
+			case "local_only":
 			case "remote_only":
 				remoteOnly.push(classification);
killedBy: classifySync classifies local-only files correctly
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:161:4
 			case "local_only":
 				localOnly.push(classification);
 				break;
-			case "remote_only":
-				remoteOnly.push(classification);
-				break;
+			case "remote_only":
 			case "local_deleted":
 				localDeleted.push(classification);
killedBy: classifySync classifies remote-only files correctly
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:164:4
 			case "remote_only":
 				remoteOnly.push(classification);
 				break;
-			case "local_deleted":
-				localDeleted.push(classification);
-				break;
+			case "local_deleted":
 			case "server_deleted":
 				serverDeleted.push(classification);
killedBy: classifySync classifies local_deleted when file was synced but deleted locally
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/sync/classify.ts:164:9
 			case "remote_only":
 				remoteOnly.push(classification);
 				break;
-			case "local_deleted":
+			case "":
 				localDeleted.push(classification);
 				break;
killedBy: classifySync classifies local_deleted when file was synced but deleted locally
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/classify.ts:167:4
 			case "local_deleted":
 				localDeleted.push(classification);
 				break;
-			case "server_deleted":
-				serverDeleted.push(classification);
-				break;
+			case "server_deleted":
 		}
 	}
killedBy: classifySync classifies server_deleted when file was synced but deleted on server
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/sync/classify.ts:167:9
 			case "local_deleted":
 				localDeleted.push(classification);
 				break;
-			case "server_deleted":
+			case "":
 				serverDeleted.push(classification);
 				break;
killedBy: classifySync classifies server_deleted when file was synced but deleted on server
statusReason: expected [] to have a length of 1 but got +0
