[Killed] LogicalOperator
src/sync/execute.ts:31:6
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePulls handles empty array
 	// 1. Execute pulls (download from server)
-	if (plan.pulls.length > 0 || plan.remoteOnly.length > 0) {
+	if (plan.pulls.length > 0 && plan.remoteOnly.length > 0) {
 		const pullResult = await executePulls(env, [...plan.pulls, ...plan.remoteOnly], syncState);
 		result.pulled = pullResult.count;
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:31:59
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePulls handles empty array
 	// 1. Execute pulls (download from server)
-	if (plan.pulls.length > 0 || plan.remoteOnly.length > 0) {
-		const pullResult = await executePulls(env, [...plan.pulls, ...plan.remoteOnly], syncState);
-		result.pulled = pullResult.count;
-		result.errors.push(...pullResult.errors);
-	}
+	if (plan.pulls.length > 0 || plan.remoteOnly.length > 0) {}
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleServerDeleted handles empty array
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:39:37
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleServerDeleted handles empty array
 	// 2. Handle server-deleted files (ask user what to do)
-	if (plan.serverDeleted.length > 0) {
-		await handleServerDeleted(env, plan.serverDeleted, syncState);
-	}
+	if (plan.serverDeleted.length > 0) {}
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleConflicts handles empty array
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:45:33
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleConflicts handles empty array
 	// 3. Handle conflicts (show UI, let user decide)
-	if (plan.conflicts.length > 0) {
-		const conflictResult = await handleConflicts(env, plan.conflicts, syncState);
-		result.conflictsResolved = conflictResult.resolved;
-		result.errors.push(...conflictResult.errors);
-	}
+	if (plan.conflicts.length > 0) {}
 
 	// 4. Confirm and execute pushes (upload to server)
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:54:25
 	// 4. Confirm and execute pushes (upload to server)
 	const toPush = [...plan.pushes, ...plan.localOnly];
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePushes handles empty array
-	if (toPush.length > 0) {
-		const confirmed = await env.confirmPush(toPush.map((c) => c.path));
-		if (confirmed) {
-			const pushResult = await executePushes(env, toPush, syncState);
-			result.pushed = pushResult.count;
-			result.errors.push(...pushResult.errors);
-		}
-	}
+	if (toPush.length > 0) {}
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleLocalDeleted handles empty array
killedBy: executePlan pushes pushes files to server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/sync/execute.ts:55:54
 	const toPush = [...plan.pushes, ...plan.localOnly];
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePushes handles empty array
 	if (toPush.length > 0) {
-		const confirmed = await env.confirmPush(toPush.map((c) => c.path));
+		const confirmed = await env.confirmPush(toPush.map(() => undefined));
 		if (confirmed) {
 			const pushResult = await executePushes(env, toPush, syncState);
killedBy: executePlan edge cases and error handling calls confirmPush with correct paths
statusReason: expected "spy" to be called with arguments: [ [ 'a.md', 'b.md' ] ]

Received: 

  1st spy call:

  [
    [

[Killed] ConditionalExpression
src/sync/execute.ts:56:7
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePushes handles empty array
 	if (toPush.length > 0) {
 		const confirmed = await env.confirmPush(toPush.map((c) => c.path));
-		if (confirmed) {
+		if (true) {
 			const pushResult = await executePushes(env, toPush, syncState);
 			result.pushed = pushResult.count;
killedBy: executePlan pushes skips push when user declines confirmation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:56:7
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - executePushes handles empty array
 	if (toPush.length > 0) {
 		const confirmed = await env.confirmPush(toPush.map((c) => c.path));
-		if (confirmed) {
+		if (false) {
 			const pushResult = await executePushes(env, toPush, syncState);
 			result.pushed = pushResult.count;
killedBy: executePlan pushes pushes files to server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:65:36
 
 	// Stryker disable next-line ConditionalExpression,EqualityOperator: optimization - handleLocalDeleted handles empty array
 	// 5. Handle local-deleted files (hide on server)
-	if (plan.localDeleted.length > 0) {
-		await handleLocalDeleted(env, plan.localDeleted, syncState);
-	}
+	if (plan.localDeleted.length > 0) {}
 
 	// 6. Commit all changes
killedBy: executePlan local deleted hides notes on server
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/sync/execute.ts:70:6
 	}
 
 	// 6. Commit all changes
-	if (result.pushed > 0) {
+	if (false) {
 		await env.commitNotes();
 	}
killedBy: executePlan pushes pushes files to server
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/sync/execute.ts:70:25
 	}
 
 	// 6. Commit all changes
-	if (result.pushed > 0) {
-		await env.commitNotes();
-	}
+	if (result.pushed > 0) {}
 
 	// 7. Save sync state
killedBy: executePlan pushes pushes files to server
statusReason: expected "spy" to be called at least once

[Killed] ArrowFunction
src/sync/execute.ts:95:26
 	}
 	// Stryker restore all
 
-	const paths = pulls.map((p) => p.path);
+	const paths = pulls.map(() => undefined);
 	const errors: string[] = [];
 	let count = 0;
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/sync/execute.ts:96:27
 	// Stryker restore all
 
 	const paths = pulls.map((p) => p.path);
-	const errors: string[] = [];
+	const errors: string[] = ["Stryker was here"];
 	let count = 0;
 
killedBy: executePlan pulls handles fetch errors gracefully
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] StringLiteral
src/sync/execute.ts:99:19
 	const errors: string[] = [];
 	let count = 0;
 
-	env.showProgress(`Pulling ${paths.length} files...`);
+	env.showProgress(``);
 
 	// Fetch contents from server
killedBy: executePlan edge cases and error handling shows progress during pulls
statusReason: expected "spy" to be called with arguments: [ StringContaining "Pulling" ]

Received: 

  1st spy call:

  [
-   StringContaining "Pulling",

[Killed] ArrowFunction
src/sync/execute.ts:103:42
 
 	// Fetch contents from server
 	const contents = await env.fetchNoteContents(paths);
-	const contentMap = new Map(contents.map((c) => [c.path, c.content]));
+	const contentMap = new Map(contents.map(() => undefined));
 
 	for (const pull of pulls) {
killedBy: executePlan pulls pulls files from server
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
src/sync/execute.ts:105:28
 	const contents = await env.fetchNoteContents(paths);
 	const contentMap = new Map(contents.map((c) => [c.path, c.content]));
 
-	for (const pull of pulls) {
-		const content = contentMap.get(pull.path);
-		if (content === undefined) {
-			errors.push(`Failed to fetch: ${pull.path}`);
-			continue;
-		}
-
-		try {
-			// Create directories if needed
-			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
-			if (dirPath) {
-				await env.createFolder(dirPath);
-			}
-
-			// Write file
-			await env.writeFile(pull.path, content);
-
-			// Update sync state
-			const hash = await env.computeHash(content);
-			syncState.files[pull.path] = hash;
-			count++;
-		} catch (e) {
-			errors.push(`Failed to write ${pull.path}: ${e}`);
-		}
-	}
+	for (const pull of pulls) {}
 
 	return { count, errors };
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:107:7
 
 	for (const pull of pulls) {
 		const content = contentMap.get(pull.path);
-		if (content === undefined) {
+		if (false) {
 			errors.push(`Failed to fetch: ${pull.path}`);
 			continue;
killedBy: executePlan pulls handles fetch errors gracefully
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/sync/execute.ts:107:7
 
 	for (const pull of pulls) {
 		const content = contentMap.get(pull.path);
-		if (content === undefined) {
+		if (content !== undefined) {
 			errors.push(`Failed to fetch: ${pull.path}`);
 			continue;
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:112:7
 			continue;
 		}
 
-		try {
-			// Create directories if needed
-			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
-			if (dirPath) {
-				await env.createFolder(dirPath);
-			}
-
-			// Write file
-			await env.writeFile(pull.path, content);
-
-			// Update sync state
-			const hash = await env.computeHash(content);
-			syncState.files[pull.path] = hash;
-			count++;
-		} catch (e) {
+		try {} catch (e) {
 			errors.push(`Failed to write ${pull.path}: ${e}`);
 		}
killedBy: executePlan pulls pulls files from server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/sync/execute.ts:114:20
 
 		try {
 			// Create directories if needed
-			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
+			const dirPath = pull.path;
 			if (dirPath) {
 				await env.createFolder(dirPath);
killedBy: executePlan pulls creates directories for nested paths
statusReason: expected "spy" to be called with arguments: [ 'folder/subfolder' ]

Received: 

  1st spy call:

  [
-   "folder/subfolder",

[Killed] StringLiteral
src/sync/execute.ts:114:65
 
 		try {
 			// Create directories if needed
-			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
+			const dirPath = pull.path.substring(0, pull.path.lastIndexOf(""));
 			if (dirPath) {
 				await env.createFolder(dirPath);
killedBy: executePlan pulls creates directories for nested paths
statusReason: expected "spy" to be called with arguments: [ 'folder/subfolder' ]

Received: 

  1st spy call:

  [
-   "folder/subfolder",

[Killed] BlockStatement
src/sync/execute.ts:115:17
 		try {
 			// Create directories if needed
 			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
-			if (dirPath) {
-				await env.createFolder(dirPath);
-			}
+			if (dirPath) {}
 
 			// Write file
killedBy: executePlan pulls creates directories for nested paths
statusReason: expected "spy" to be called with arguments: [ 'folder/subfolder' ]

Number of calls: 0

[Killed] ConditionalExpression
src/sync/execute.ts:115:8
 		try {
 			// Create directories if needed
 			const dirPath = pull.path.substring(0, pull.path.lastIndexOf("/"));
-			if (dirPath) {
+			if (false) {
 				await env.createFolder(dirPath);
 			}
killedBy: executePlan pulls creates directories for nested paths
statusReason: expected "spy" to be called with arguments: [ 'folder/subfolder' ]

Number of calls: 0

[Killed] UpdateOperator
src/sync/execute.ts:125:4
 			// Update sync state
 			const hash = await env.computeHash(content);
 			syncState.files[pull.path] = hash;
-			count++;
+			count--;
 		} catch (e) {
 			errors.push(`Failed to write ${pull.path}: ${e}`);
killedBy: executePlan pulls pulls files from server
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:126:15
 			const hash = await env.computeHash(content);
 			syncState.files[pull.path] = hash;
 			count++;
-		} catch (e) {
-			errors.push(`Failed to write ${pull.path}: ${e}`);
-		}
+		} catch (e) {}
 	}
 
killedBy: executePlan edge cases and error handling handles write errors during pull
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
src/sync/execute.ts:131:9
 		}
 	}
 
-	return { count, errors };
+	return {};
 }
 
killedBy: executePlan pulls pulls files from server
statusReason: pullResult.errors is not iterable (cannot read property undefined)

[Killed] ArrayDeclaration
src/sync/execute.ts:149:27
 	}
 	// Stryker restore all
 
-	const errors: string[] = [];
+	const errors: string[] = ["Stryker was here"];
 	const updates: NoteUpdate[] = [];
 
killedBy: executePlan pushes handles read errors gracefully
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/sync/execute.ts:155:29
 	env.showProgress(`Pushing ${pushes.length} files...`);
 
 	// Read all file contents
-	for (const push of pushes) {
-		try {
-			const content = await env.readFileContent(push.path);
-			updates.push({ path: push.path, content });
-		} catch (e) {
-			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
-			errors.push(`Failed to read ${push.path}: ${e}`);
-		}
-	}
+	for (const push of pushes) {}
 
 	// Stryker disable next-line ConditionalExpression,BlockStatement: optimization when all reads fail
killedBy: executePlan pushes pushes files to server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:156:7
 
 	// Read all file contents
 	for (const push of pushes) {
-		try {
-			const content = await env.readFileContent(push.path);
-			updates.push({ path: push.path, content });
-		} catch (e) {
+		try {} catch (e) {
 			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
 			errors.push(`Failed to read ${push.path}: ${e}`);
killedBy: executePlan pushes pushes files to server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:159:15
 		try {
 			const content = await env.readFileContent(push.path);
 			updates.push({ path: push.path, content });
-		} catch (e) {
-			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
-			errors.push(`Failed to read ${push.path}: ${e}`);
-		}
+		} catch (e) {}
 	}
 
killedBy: executePlan pushes handles read errors gracefully
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/sync/execute.ts:166:6
 	}
 
 	// Stryker disable next-line ConditionalExpression,BlockStatement: optimization when all reads fail
-	if (updates.length === 0) {
+	if (updates.length !== 0) {
 		return { count: 0, errors };
 	}
killedBy: executePlan pushes pushes files to server
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/sync/execute.ts:171:51
 	}
 
 	// Push to server (skipCommit=true, we'll commit at the end)
-	const pushedNotes = await env.pushNotes(updates, true);
+	const pushedNotes = await env.pushNotes(updates, false);
 
 	// Update sync state for successfully pushed files
killedBy: executePlan pushes pushes files to server
statusReason: expected "spy" to be called with arguments: [ [ { path: 'note.md', …(1) } ], true ]

Received: 

  1st spy call:

@@ -3,7 +3,7 @@
      {

[Killed] ArrowFunction
src/sync/execute.ts:174:46
 	const pushedNotes = await env.pushNotes(updates, true);
 
 	// Update sync state for successfully pushed files
-	const pushedPaths = new Set(pushedNotes.map((n) => n.path));
+	const pushedPaths = new Set(pushedNotes.map(() => undefined));
 	for (const update of updates) {
 		if (pushedPaths.has(update.path)) {
killedBy: executePlan pushes pushes files to server
statusReason: expected undefined to be 'hash:local content' // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:175:32
 
 	// Update sync state for successfully pushed files
 	const pushedPaths = new Set(pushedNotes.map((n) => n.path));
-	for (const update of updates) {
-		if (pushedPaths.has(update.path)) {
-			const hash = await env.computeHash(update.content);
-			syncState.files[update.path] = hash;
-		}
-	}
+	for (const update of updates) {}
 
 	return { count: pushedPaths.size, errors };
killedBy: executePlan pushes pushes files to server
statusReason: expected undefined to be 'hash:local content' // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:176:7
 	// Update sync state for successfully pushed files
 	const pushedPaths = new Set(pushedNotes.map((n) => n.path));
 	for (const update of updates) {
-		if (pushedPaths.has(update.path)) {
+		if (true) {
 			const hash = await env.computeHash(update.content);
 			syncState.files[update.path] = hash;
killedBy: executePlan edge cases and error handling updates syncState only for successfully pushed files
statusReason: expected 'hash:b' to be undefined

[Killed] ConditionalExpression
src/sync/execute.ts:176:7
 	// Update sync state for successfully pushed files
 	const pushedPaths = new Set(pushedNotes.map((n) => n.path));
 	for (const update of updates) {
-		if (pushedPaths.has(update.path)) {
+		if (false) {
 			const hash = await env.computeHash(update.content);
 			syncState.files[update.path] = hash;
killedBy: executePlan pushes pushes files to server
statusReason: expected undefined to be 'hash:local content' // Object.is equality

[Killed] ArrowFunction
src/sync/execute.ts:203:30
 	const errors: string[] = [];
 
 	// Fetch remote contents
-	const paths = conflicts.map((c) => c.path);
+	const paths = conflicts.map(() => undefined);
 	const remoteContents = await env.fetchNoteContents(paths);
 	const remoteMap = new Map(remoteContents.map((c) => [c.path, c.content]));
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/sync/execute.ts:205:47
 	// Fetch remote contents
 	const paths = conflicts.map((c) => c.path);
 	const remoteContents = await env.fetchNoteContents(paths);
-	const remoteMap = new Map(remoteContents.map((c) => [c.path, c.content]));
+	const remoteMap = new Map(remoteContents.map(() => undefined));
 
 	// Build conflict infos
killedBy: executePlan conflicts handles keep_local resolution
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
src/sync/execute.ts:209:36
 
 	// Build conflict infos
 	const conflictInfos: ConflictInfo[] = [];
-	for (const conflict of conflicts) {
-		const remoteContent = remoteMap.get(conflict.path);
-		if (remoteContent === undefined) {
-			continue; // Remote no longer exists
-		}
-
-		try {
-			const localContent = await env.readFileContent(conflict.path);
-			conflictInfos.push({
-				path: conflict.path,
-				localContent,
-				remoteContent,
-				localHash: conflict.localHash!,
-				remoteHash: conflict.remoteHash!,
-			});
-		} catch (e) {
-			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
-			errors.push(`Failed to read local file for conflict: ${conflict.path}`);
-		}
-	}
+	for (const conflict of conflicts) {}
 
 	if (conflictInfos.length === 0) {
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:211:7
 	const conflictInfos: ConflictInfo[] = [];
 	for (const conflict of conflicts) {
 		const remoteContent = remoteMap.get(conflict.path);
-		if (remoteContent === undefined) {
+		if (false) {
 			continue; // Remote no longer exists
 		}
killedBy: executePlan conflicts skips conflicts when remote no longer exists
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:211:7
 	const conflictInfos: ConflictInfo[] = [];
 	for (const conflict of conflicts) {
 		const remoteContent = remoteMap.get(conflict.path);
-		if (remoteContent === undefined) {
+		if (true) {
 			continue; // Remote no longer exists
 		}
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:215:7
 			continue; // Remote no longer exists
 		}
 
-		try {
-			const localContent = await env.readFileContent(conflict.path);
-			conflictInfos.push({
-				path: conflict.path,
-				localContent,
-				remoteContent,
-				localHash: conflict.localHash!,
-				remoteHash: conflict.remoteHash!,
-			});
-		} catch (e) {
+		try {} catch (e) {
 			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
 			errors.push(`Failed to read local file for conflict: ${conflict.path}`);
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/sync/execute.ts:217:23
 
 		try {
 			const localContent = await env.readFileContent(conflict.path);
-			conflictInfos.push({
-				path: conflict.path,
-				localContent,
-				remoteContent,
-				localHash: conflict.localHash!,
-				remoteHash: conflict.remoteHash!,
-			});
+			conflictInfos.push({});
 		} catch (e) {
 			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected "spy" to be called with arguments: [ [ { path: 'note.md', …(1) } ], true ]

Received: 

  1st spy call:

  [
    [

[Killed] BlockStatement
src/sync/execute.ts:224:15
 				localHash: conflict.localHash!,
 				remoteHash: conflict.remoteHash!,
 			});
-		} catch (e) {
-			// Stryker disable next-line StringLiteral: error message content doesn't affect behavior
-			errors.push(`Failed to read local file for conflict: ${conflict.path}`);
-		}
+		} catch (e) {}
 	}
 
killedBy: executePlan edge cases and error handling handles errors reading local file for conflict
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/sync/execute.ts:230:6
 		}
 	}
 
-	if (conflictInfos.length === 0) {
+	if (false) {
 		return { resolved: 0, errors };
 	}
killedBy: executePlan conflicts skips conflicts when remote no longer exists
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Array [],

[Killed] ConditionalExpression
src/sync/execute.ts:230:6
 		}
 	}
 
-	if (conflictInfos.length === 0) {
+	if (true) {
 		return { resolved: 0, errors };
 	}
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/sync/execute.ts:231:10
 	}
 
 	if (conflictInfos.length === 0) {
-		return { resolved: 0, errors };
+		return {};
 	}
 
killedBy: executePlan conflicts skips conflicts when remote no longer exists
statusReason: conflictResult.errors is not iterable (cannot read property undefined)

[Killed] ConditionalExpression
src/sync/execute.ts:240:18
 	// Process each resolution
 	let resolved = 0;
 	// Stryker disable next-line EqualityOperator: <= would cause out-of-bounds access; tests verify correct iteration
-	for (let i = 0; i < conflictInfos.length; i++) {
+	for (let i = 0; false; i++) {
 		const info = conflictInfos[i];
 		const resolution = resolutions[i] || "skip";
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:240:49
 	// Process each resolution
 	let resolved = 0;
 	// Stryker disable next-line EqualityOperator: <= would cause out-of-bounds access; tests verify correct iteration
-	for (let i = 0; i < conflictInfos.length; i++) {
-		const info = conflictInfos[i];
-		const resolution = resolutions[i] || "skip";
-
-		try {
-			await resolveConflict(env, info, resolution, syncState);
-			if (resolution !== "skip") {
-				resolved++;
-			}
-		} catch (e) {
-			errors.push(`Failed to resolve conflict for ${info.path}: ${e}`);
-		}
-	}
+	for (let i = 0; i < conflictInfos.length; i++) {}
 
 	return { resolved, errors };
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/sync/execute.ts:242:22
 	// Stryker disable next-line EqualityOperator: <= would cause out-of-bounds access; tests verify correct iteration
 	for (let i = 0; i < conflictInfos.length; i++) {
 		const info = conflictInfos[i];
-		const resolution = resolutions[i] || "skip";
+		const resolution = resolutions[i] && "skip";
 
 		try {
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:242:22
 	// Stryker disable next-line EqualityOperator: <= would cause out-of-bounds access; tests verify correct iteration
 	for (let i = 0; i < conflictInfos.length; i++) {
 		const info = conflictInfos[i];
-		const resolution = resolutions[i] || "skip";
+		const resolution = false;
 
 		try {
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected "spy" to be called with arguments: [ [ { path: 'note.md', …(1) } ], true ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:244:7
 		const info = conflictInfos[i];
 		const resolution = resolutions[i] || "skip";
 
-		try {
-			await resolveConflict(env, info, resolution, syncState);
-			if (resolution !== "skip") {
-				resolved++;
-			}
-		} catch (e) {
+		try {} catch (e) {
 			errors.push(`Failed to resolve conflict for ${info.path}: ${e}`);
 		}
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:246:8
 
 		try {
 			await resolveConflict(env, info, resolution, syncState);
-			if (resolution !== "skip") {
+			if (true) {
 				resolved++;
 			}
killedBy: executePlan conflicts handles skip resolution
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:246:8
 
 		try {
 			await resolveConflict(env, info, resolution, syncState);
-			if (resolution !== "skip") {
+			if (false) {
 				resolved++;
 			}
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/sync/execute.ts:247:5
 		try {
 			await resolveConflict(env, info, resolution, syncState);
 			if (resolution !== "skip") {
-				resolved++;
+				resolved--;
 			}
 		} catch (e) {
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:249:15
 			if (resolution !== "skip") {
 				resolved++;
 			}
-		} catch (e) {
-			errors.push(`Failed to resolve conflict for ${info.path}: ${e}`);
-		}
+		} catch (e) {}
 	}
 
killedBy: executePlan edge cases and error handling handles errors during conflict resolution
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/sync/execute.ts:267:3
 	syncState: SyncState
 ): Promise<void> {
 	switch (resolution) {
-		case "keep_local":
-			// Push local version to server
-			await env.pushNotes([{ path: conflict.path, content: conflict.localContent }], true);
-			syncState.files[conflict.path] = conflict.localHash;
-			break;
+		case "keep_local":
 
 		case "keep_remote":
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected "spy" to be called with arguments: [ [ { path: 'note.md', …(1) } ], true ]

Number of calls: 0

[Killed] BooleanLiteral
src/sync/execute.ts:269:83
 	switch (resolution) {
 		case "keep_local":
 			// Push local version to server
-			await env.pushNotes([{ path: conflict.path, content: conflict.localContent }], true);
+			await env.pushNotes([{ path: conflict.path, content: conflict.localContent }], false);
 			syncState.files[conflict.path] = conflict.localHash;
 			break;
killedBy: executePlan conflicts handles keep_local resolution
statusReason: expected "spy" to be called with arguments: [ [ { path: 'note.md', …(1) } ], true ]

Received: 

  1st spy call:

@@ -3,7 +3,7 @@
      {

[Killed] ConditionalExpression
src/sync/execute.ts:273:3
 			syncState.files[conflict.path] = conflict.localHash;
 			break;
 
-		case "keep_remote":
-			// Overwrite local with remote
-			await env.writeFile(conflict.path, conflict.remoteContent);
-			syncState.files[conflict.path] = conflict.remoteHash;
-			break;
+		case "keep_remote":
 
 		case "keep_both":
killedBy: executePlan conflicts handles keep_remote resolution
statusReason: expected "spy" to be called with arguments: [ 'note.md', 'server version' ]

Received: 

  1st spy call:

  [
-   "note.md",

[Killed] StringLiteral
src/sync/execute.ts:273:8
 			syncState.files[conflict.path] = conflict.localHash;
 			break;
 
-		case "keep_remote":
+		case "":
 			// Overwrite local with remote
 			await env.writeFile(conflict.path, conflict.remoteContent);
killedBy: executePlan conflicts handles keep_remote resolution
statusReason: expected "spy" to be called with arguments: [ 'note.md', 'server version' ]

Number of calls: 0
