[Killed] ConditionalExpression
src/sync/execute.ts:279:3
 			syncState.files[conflict.path] = conflict.remoteHash;
 			break;
 
-		case "keep_both":
-			// Create copy with server version
-			const ext = conflict.path.substring(conflict.path.lastIndexOf("."));
-			const baseName = conflict.path.substring(0, conflict.path.lastIndexOf("."));
-			const newPath = `${baseName} (server)${ext}`;
-
-			await env.writeFile(newPath, conflict.remoteContent);
-
-			// Update sync state for both
-			syncState.files[conflict.path] = conflict.localHash;
-			const remoteHash = await env.computeHash(conflict.remoteContent);
-			syncState.files[newPath] = remoteHash;
-			break;
+		case "keep_both":
+
+// Stryker disable next-line StringLiteral,ConditionalExpression: skip case is intentionally empty
 
 		// Stryker disable next-line StringLiteral,ConditionalExpression: skip case is intentionally empty
killedBy: executePlan conflicts handles keep_both resolution
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] MethodExpression
src/sync/execute.ts:281:16
 
 		case "keep_both":
 			// Create copy with server version
-			const ext = conflict.path.substring(conflict.path.lastIndexOf("."));
+			const ext = conflict.path;
 			const baseName = conflict.path.substring(0, conflict.path.lastIndexOf("."));
 			const newPath = `${baseName} (server)${ext}`;
killedBy: executePlan conflicts handles keep_both resolution
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 

  1st spy call:

  [
-   "note (server).md",

[Killed] MethodExpression
src/sync/execute.ts:282:21
 		case "keep_both":
 			// Create copy with server version
 			const ext = conflict.path.substring(conflict.path.lastIndexOf("."));
-			const baseName = conflict.path.substring(0, conflict.path.lastIndexOf("."));
+			const baseName = conflict.path;
 			const newPath = `${baseName} (server)${ext}`;
 
killedBy: executePlan conflicts handles keep_both resolution
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 

  1st spy call:

  [
-   "note (server).md",

[Killed] EqualityOperator
src/sync/execute.ts:309:6
 	syncState: SyncState
 ): Promise<void> {
 	// Stryker disable next-line ConditionalExpression,BlockStatement: optimization - caller already filters empty
-	if (serverDeleted.length === 0) {
+	if (serverDeleted.length !== 0) {
 		return;
 	}
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Number of calls: 0

[Killed] ArrowFunction
src/sync/execute.ts:313:34
 		return;
 	}
 
-	const paths = serverDeleted.map((c) => c.path);
+	const paths = serverDeleted.map(() => undefined);
 	const deleteLocally = await env.onServerDeleted(paths);
 
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Received: 

  1st spy call:

  [
    [

[Killed] ConditionalExpression
src/sync/execute.ts:316:6
 	const paths = serverDeleted.map((c) => c.path);
 	const deleteLocally = await env.onServerDeleted(paths);
 
-	if (deleteLocally) {
+	if (false) {
 		// Delete local files
 		for (const c of serverDeleted) {
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ 'deleted.md' ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:316:21
 	const paths = serverDeleted.map((c) => c.path);
 	const deleteLocally = await env.onServerDeleted(paths);
 
-	if (deleteLocally) {
-		// Delete local files
-		for (const c of serverDeleted) {
-			try {
-				await env.deleteFile(c.path);
-				delete syncState.files[c.path];
-			} catch (e) {
-				// File might not exist, ignore
-			}
-		}
-	} else {
+	if (deleteLocally) {} else {
 		// Keep locally - update syncState to current local hash
 		for (const c of serverDeleted) {
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ 'deleted.md' ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:318:34
 
 	if (deleteLocally) {
 		// Delete local files
-		for (const c of serverDeleted) {
-			try {
-				await env.deleteFile(c.path);
-				delete syncState.files[c.path];
-			} catch (e) {
-				// File might not exist, ignore
-			}
-		}
+		for (const c of serverDeleted) {}
 	} else {
 		// Keep locally - update syncState to current local hash
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ 'deleted.md' ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:319:8
 	if (deleteLocally) {
 		// Delete local files
 		for (const c of serverDeleted) {
-			try {
-				await env.deleteFile(c.path);
-				delete syncState.files[c.path];
-			} catch (e) {
+			try {} catch (e) {
 				// File might not exist, ignore
 			}
killedBy: executePlan server deleted deletes local files when user confirms
statusReason: expected "spy" to be called with arguments: [ 'deleted.md' ]

Number of calls: 0

[Killed] BlockStatement
src/sync/execute.ts:326:9
 				// File might not exist, ignore
 			}
 		}
-	} else {
-		// Keep locally - update syncState to current local hash
-		for (const c of serverDeleted) {
-			if (c.localHash) {
-				syncState.files[c.path] = c.localHash;
-			}
-		}
-	}
+	} else {}
 }
 
killedBy: executePlan server deleted keeps local files when user declines
statusReason: expected undefined to be 'local_hash' // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:328:34
 		}
 	} else {
 		// Keep locally - update syncState to current local hash
-		for (const c of serverDeleted) {
-			if (c.localHash) {
-				syncState.files[c.path] = c.localHash;
-			}
-		}
+		for (const c of serverDeleted) {}
 	}
 }
killedBy: executePlan server deleted keeps local files when user declines
statusReason: expected undefined to be 'local_hash' // Object.is equality

[Killed] BlockStatement
src/sync/execute.ts:329:21
 	} else {
 		// Keep locally - update syncState to current local hash
 		for (const c of serverDeleted) {
-			if (c.localHash) {
-				syncState.files[c.path] = c.localHash;
-			}
+			if (c.localHash) {}
 		}
 	}
killedBy: executePlan server deleted keeps local files when user declines
statusReason: expected undefined to be 'local_hash' // Object.is equality

[Killed] ConditionalExpression
src/sync/execute.ts:329:8
 	} else {
 		// Keep locally - update syncState to current local hash
 		for (const c of serverDeleted) {
-			if (c.localHash) {
+			if (true) {
 				syncState.files[c.path] = c.localHash;
 			}
killedBy: executePlan edge cases and error handling keeps files with null localHash during server_deleted decline
statusReason: expected null to be undefined

[Killed] BlockStatement
src/sync/execute.ts:343:18
 	env: SyncEnv,
 	localDeleted: FileClassification[],
 	syncState: SyncState
-): Promise<void> {
-	// Stryker disable next-line ConditionalExpression,BlockStatement: optimization - caller already filters empty
-	if (localDeleted.length === 0) {
-		return;
-	}
-
-	const paths = localDeleted.map((c) => c.path);
-	await env.hideNotes(paths);
-
-	// Remove from sync state
-	for (const path of paths) {
-		delete syncState.files[path];
-	}
-}
+): Promise<void> {}
 
killedBy: executePlan local deleted hides notes on server
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Number of calls: 0

[Killed] EqualityOperator
src/sync/execute.ts:345:6
 	syncState: SyncState
 ): Promise<void> {
 	// Stryker disable next-line ConditionalExpression,BlockStatement: optimization - caller already filters empty
-	if (localDeleted.length === 0) {
+	if (localDeleted.length !== 0) {
 		return;
 	}
killedBy: executePlan local deleted hides notes on server
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Number of calls: 0

[Killed] ArrowFunction
src/sync/execute.ts:349:33
 		return;
 	}
 
-	const paths = localDeleted.map((c) => c.path);
+	const paths = localDeleted.map(() => undefined);
 	await env.hideNotes(paths);
 
killedBy: executePlan local deleted hides notes on server
statusReason: expected "spy" to be called with arguments: [ [ 'deleted.md' ] ]

Received: 

  1st spy call:

  [
    [

[Killed] BlockStatement
src/sync/execute.ts:353:28
 	await env.hideNotes(paths);
 
 	// Remove from sync state
-	for (const path of paths) {
-		delete syncState.files[path];
-	}
+	for (const path of paths) {}
 }
 
killedBy: executePlan local deleted hides notes on server
statusReason: expected 'hash' to be undefined
