[Killed] BlockStatement
src/sync/filter.ts:22:51
 	const { twoWaySync, hasPublishFields } = options;
 
 	// Helper to check if file should be included based on publishFields
-	const isPublishable = (path: string): boolean => {
-		if (!hasPublishFields) return true; // No filter = all files publishable
-		return hasPublishFields(path);
-	};
+	const isPublishable = (path: string): boolean => {};
 
 	const filteredClassifications: FileClassification[] = [];
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:23:7
 
 	// Helper to check if file should be included based on publishFields
 	const isPublishable = (path: string): boolean => {
-		if (!hasPublishFields) return true; // No filter = all files publishable
+		if (false) return true; // No filter = all files publishable
 		return hasPublishFields(path);
 	};
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: hasPublishFields is not a function

[Killed] BooleanLiteral
src/sync/filter.ts:23:33
 
 	// Helper to check if file should be included based on publishFields
 	const isPublishable = (path: string): boolean => {
-		if (!hasPublishFields) return true; // No filter = all files publishable
+		if (!hasPublishFields) return false; // No filter = all files publishable
 		return hasPublishFields(path);
 	};
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/sync/filter.ts:27:56
 		return hasPublishFields(path);
 	};
 
-	const filteredClassifications: FileClassification[] = [];
+	const filteredClassifications: FileClassification[] = ["Stryker was here"];
 	const pulls: FileClassification[] = [];
 	const pushes: FileClassification[] = [];
killedBy: filterPlan twoWaySync: false (push only) ignores pulls when twoWaySync is false
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] ArrayDeclaration
src/sync/filter.ts:29:39
 
 	const filteredClassifications: FileClassification[] = [];
 	const pulls: FileClassification[] = [];
-	const pushes: FileClassification[] = [];
+	const pushes: FileClassification[] = ["Stryker was here"];
 	const conflicts: FileClassification[] = [];
 	const localOnly: FileClassification[] = [];
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/filter.ts:41:4
 		const publishable = isPublishable(c.path);
 
 		switch (c.action) {
-			case "unchanged":
-				filteredClassifications.push(c);
-				unchanged++;
-				break;
+			case "unchanged":
 
 			case "pull":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [ { path: 'pull.md', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] UpdateOperator
src/sync/filter.ts:43:5
 		switch (c.action) {
 			case "unchanged":
 				filteredClassifications.push(c);
-				unchanged++;
+				unchanged--;
 				break;
 
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sync/filter.ts:46:4
 				unchanged++;
 				break;
 
-			case "pull":
-				if (twoWaySync && publishable) {
-					filteredClassifications.push(c);
-					pulls.push(c);
-				}
-				// If not twoWaySync or not publishable -> ignored (protected)
-				break;
+			case "pull":
 
 			case "push":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/sync/filter.ts:46:9
 				unchanged++;
 				break;
 
-			case "pull":
+			case "":
 				if (twoWaySync && publishable) {
 					filteredClassifications.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:47:9
 				break;
 
 			case "pull":
-				if (twoWaySync && publishable) {
+				if (false) {
 					filteredClassifications.push(c);
 					pulls.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:47:9
 				break;
 
 			case "pull":
-				if (twoWaySync && publishable) {
+				if (true) {
 					filteredClassifications.push(c);
 					pulls.push(c);
killedBy: filterPlan twoWaySync: false (push only) ignores pulls when twoWaySync is false
statusReason: expected [ { path: 'note.md', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/sync/filter.ts:54:4
 				// If not twoWaySync or not publishable -> ignored (protected)
 				break;
 
-			case "push":
-				if (publishable) {
-					filteredClassifications.push(c);
-					pushes.push(c);
-				}
-				// If not publishable -> ignored
-				break;
+			case "push":
 
 			case "conflict":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:55:9
 				break;
 
 			case "push":
-				if (publishable) {
+				if (true) {
 					filteredClassifications.push(c);
 					pushes.push(c);
killedBy: filterPlan publishFields filtering filters out push when file is not publishable
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/filter.ts:55:9
 				break;
 
 			case "push":
-				if (publishable) {
+				if (false) {
 					filteredClassifications.push(c);
 					pushes.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:62:4
 				// If not publishable -> ignored
 				break;
 
-			case "conflict":
-				if (!twoWaySync) {
-					// Conflict becomes push when twoWaySync is off
-					if (publishable) {
-						const asPush: FileClassification = { ...c, action: "push" };
-						filteredClassifications.push(asPush);
-						pushes.push(asPush);
-					}
-				} else if (publishable) {
-					filteredClassifications.push(c);
-					conflicts.push(c);
-				}
-				// If not publishable -> ignored (protected)
-				break;
+			case "conflict":
 
 			case "local_only":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/sync/filter.ts:63:9
 				break;
 
 			case "conflict":
-				if (!twoWaySync) {
+				if (twoWaySync) {
 					// Conflict becomes push when twoWaySync is off
 					if (publishable) {
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [ { path: 'push.md', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/sync/filter.ts:63:22
 				break;
 
 			case "conflict":
-				if (!twoWaySync) {
-					// Conflict becomes push when twoWaySync is off
-					if (publishable) {
-						const asPush: FileClassification = { ...c, action: "push" };
-						filteredClassifications.push(asPush);
-						pushes.push(asPush);
-					}
-				} else if (publishable) {
+				if (!twoWaySync) {} else if (publishable) {
 					filteredClassifications.push(c);
 					conflicts.push(c);
killedBy: filterPlan twoWaySync: false (push only) converts conflict to push when twoWaySync is false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:65:10
 			case "conflict":
 				if (!twoWaySync) {
 					// Conflict becomes push when twoWaySync is off
-					if (publishable) {
+					if (true) {
 						const asPush: FileClassification = { ...c, action: "push" };
 						filteredClassifications.push(asPush);
killedBy: filterPlan combined: twoWaySync false + publishFields converts conflict to push only for publishable files
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/filter.ts:65:10
 			case "conflict":
 				if (!twoWaySync) {
 					// Conflict becomes push when twoWaySync is off
-					if (publishable) {
+					if (false) {
 						const asPush: FileClassification = { ...c, action: "push" };
 						filteredClassifications.push(asPush);
killedBy: filterPlan twoWaySync: false (push only) converts conflict to push when twoWaySync is false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/sync/filter.ts:66:42
 				if (!twoWaySync) {
 					// Conflict becomes push when twoWaySync is off
 					if (publishable) {
-						const asPush: FileClassification = { ...c, action: "push" };
+						const asPush: FileClassification = {};
 						filteredClassifications.push(asPush);
 						pushes.push(asPush);
killedBy: filterPlan twoWaySync: false (push only) converts conflict to push when twoWaySync is false
statusReason: expected undefined to be 'note.md' // Object.is equality

[Killed] BlockStatement
src/sync/filter.ts:70:29
 						filteredClassifications.push(asPush);
 						pushes.push(asPush);
 					}
-				} else if (publishable) {
-					filteredClassifications.push(c);
-					conflicts.push(c);
-				}
+				} else if (publishable) {}
 				// If not publishable -> ignored (protected)
 				break;
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:70:16
 						filteredClassifications.push(asPush);
 						pushes.push(asPush);
 					}
-				} else if (publishable) {
+				} else if (false) {
 					filteredClassifications.push(c);
 					conflicts.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:77:4
 				// If not publishable -> ignored (protected)
 				break;
 
-			case "local_only":
-				if (publishable) {
-					filteredClassifications.push(c);
-					localOnly.push(c);
-				}
-				// If not publishable -> ignored
-				break;
+			case "local_only":
 
 			case "remote_only":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/sync/filter.ts:78:22
 				break;
 
 			case "local_only":
-				if (publishable) {
-					filteredClassifications.push(c);
-					localOnly.push(c);
-				}
+				if (publishable) {}
 				// If not publishable -> ignored
 				break;
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:78:9
 				break;
 
 			case "local_only":
-				if (publishable) {
+				if (true) {
 					filteredClassifications.push(c);
 					localOnly.push(c);
killedBy: filterPlan publishFields filtering filters out local_only when file is not publishable
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/filter.ts:85:4
 				// If not publishable -> ignored
 				break;
 
-			case "remote_only":
-				if (twoWaySync) {
-					// remote_only doesn't depend on publishable (new file from server)
-					filteredClassifications.push(c);
-					remoteOnly.push(c);
-				}
-				// If not twoWaySync -> ignored
-				break;
+			case "remote_only":
 
 			case "local_deleted":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:86:9
 				break;
 
 			case "remote_only":
-				if (twoWaySync) {
+				if (false) {
 					// remote_only doesn't depend on publishable (new file from server)
 					filteredClassifications.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:86:9
 				break;
 
 			case "remote_only":
-				if (twoWaySync) {
+				if (true) {
 					// remote_only doesn't depend on publishable (new file from server)
 					filteredClassifications.push(c);
killedBy: filterPlan twoWaySync: false (push only) ignores remote_only when twoWaySync is false
statusReason: expected [ { path: 'note.md', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/sync/filter.ts:94:4
 				// If not twoWaySync -> ignored
 				break;
 
-			case "local_deleted":
-				if (publishable) {
-					filteredClassifications.push(c);
-					localDeleted.push(c);
-				}
-				// If not publishable -> ignored (was never synced anyway)
-				break;
+			case "local_deleted":
 
 			case "server_deleted":
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/sync/filter.ts:94:9
 				// If not twoWaySync -> ignored
 				break;
 
-			case "local_deleted":
+			case "":
 				if (publishable) {
 					filteredClassifications.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/sync/filter.ts:95:22
 				break;
 
 			case "local_deleted":
-				if (publishable) {
-					filteredClassifications.push(c);
-					localDeleted.push(c);
-				}
+				if (publishable) {}
 				// If not publishable -> ignored (was never synced anyway)
 				break;
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:95:9
 				break;
 
 			case "local_deleted":
-				if (publishable) {
+				if (true) {
 					filteredClassifications.push(c);
 					localDeleted.push(c);
killedBy: filterPlan publishFields filtering filters out local_deleted when file is not publishable
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/sync/filter.ts:102:4
 				// If not publishable -> ignored (was never synced anyway)
 				break;
 
-			case "server_deleted":
-				if (twoWaySync) {
-					filteredClassifications.push(c);
-					serverDeleted.push(c);
-				}
-				// If not twoWaySync -> ignored
-				break;
+			case "server_deleted":
 		}
 	}
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/sync/filter.ts:103:9
 				break;
 
 			case "server_deleted":
-				if (twoWaySync) {
+				if (false) {
 					filteredClassifications.push(c);
 					serverDeleted.push(c);
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/sync/filter.ts:103:21
 				break;
 
 			case "server_deleted":
-				if (twoWaySync) {
-					filteredClassifications.push(c);
-					serverDeleted.push(c);
-				}
+				if (twoWaySync) {}
 				// If not twoWaySync -> ignored
 				break;
killedBy: filterPlan twoWaySync: true (full sync) keeps all actions when twoWaySync is true
statusReason: expected [] to have a length of 1 but got +0
